{
    "todos": [
      {
        "id": "90b7a228-a21f-44a1-9c44-d113e06cef9d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/90b7a228-a21f-44a1-9c44-d113e06cef9d",
        "created_at": "Wed Jun 03 19:36:58 UTC 2020",
        "company": "Kasisto",
        "company_url": "http://www.kasisto.coom",
        "location": "New York",
        "title": "Front-End Software Engineer",
        "description": "<p>Humanizing Digital Experiences®</p>\n<p>Kasisto’s Digital Experience Platform, KAI, is designed for financial institutions to deliver the industry’s most amazing Conversational AI powered intelligent virtual assistants to their customers. KAI is open and extensible, and also fluent in the language of banking and finance. From simple retail transactions to the complex demands of corporate banks and wealth management, financial institutions can deliver meaningful digital interactions with KAI that help build their digital brand.</p>\n<p>Financial institutions around the world use KAI, including DBS Bank, J.P. Morgan, Mastercard, Standard Chartered, TD Bank, and Manulife Bank among others. They chose KAI for its proven track record to drive business results while improving customer experiences. The platform is used by millions of consumers around the world, all the time, across multiple channels, in different languages, and is optimized for performance, scalability, security, and compliance.</p>\n<p>This position</p>\n<p>We are looking for a Full-Stack, client side software engineer to help build and integrate responsive chat interfaces, analytics dashboards and reporting tools.</p>\n<p>What you’ll be doing</p>\n<p>Working closely with clients and internal engineering, product and design teams to gather requirements\nBuilding and integrating front-end applications with CSS, HTML, Javascript, jQuery, Vue.js, Webpack, Handlebars.js, LESS, Backbone, Python, Django and Java\nWorking to improve user experience and functionality for tools\nWriting testable code utilizing common front-end unit and BDD testing frameworks\nWhat you need for this position</p>\n<p>3+ years in client-side web development with CSS, HTML, Javascript and jQuery\nProven, full-stack front-end experience using Python and Django\nOther Modern Web Framework(s) experience is a plus (React, Vue, Angular, Ember)\nExperience working collaboratively to build scalable, modular, production software in an Agile environment\nExperience using RESTful json services\nNode.js and API development familiarity is plus\nD3.js is a plus</p>\n<p>What we offer:</p>\n<p>Competitive compensation package\nGround floor opportunity within rapidly growing tech startup\nGreat collaborative team environment\nFull Benefits\nFun perks</p>\n<p>Location - NYC, Flatiron District</p>\n<p>We welcome your cover letter with a description of your previous complete experience and your resume.  Applicants must be authorized to work in the US as we are unable to sponsor.  Kasisto is an equal opportunity employer.</p>\n",
        "how_to_apply": "<p>Please email a copy of your resume and online portfolio to <a href=\"mailto:wes@kasisto.com\">wes@kasisto.com</a> &amp; CC <a href=\"mailto:eric@kasisto.com\">eric@kasisto.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNFIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8401c5084da6bb1a0cacdd3ef319e6f919fcc738/Kasisto_Logo_c90x90.png"
      },
      {
        "id": "9c481778-db91-41c6-882a-05d353968cc8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9c481778-db91-41c6-882a-05d353968cc8",
        "created_at": "Wed Jun 03 01:53:19 UTC 2020",
        "company": "Lev",
        "company_url": "http://www.levcapital.com",
        "location": "NYC",
        "title": "Senior Engineer ",
        "description": "<p>Lev helps real estate owners and investors get the best financing for their property. We bring together Humans + Technology to provide the best in real estate capital markets advisory to our clients.</p>\n<p>Backed by leaders in commercial real estate and venture capital, including ANIMO Ventures and Ludlow Ventures, we are excited to leverage incredible user experiences, smart technology and beautiful workflows to bring fairness and transparency to this $500+ billion industry.</p>\n<p>We are looking for a passionate problem solver to join our (still small) engineering team.  In this role, you’ll get to wear many hats and be responsible for multiple projects including our proprietary smart lead sourcing and placing system.  You’ll also work directly with our CTO by constantly discussing, architecting, developing new features/products, and making sure they are delivered on time while functioning properly.</p>\n<p>Our current stack consists of Python, Flask, Postgres on the backend, and React.js in the Front-end.</p>\n<p>Roles &amp; Responsibilities:</p>\n<ul>\n<li>Write beautiful Python code that’s focused on scalability, testability, and maintainability.</li>\n<li>Maintain and improve our Flask API which is the backbone of our platform.</li>\n<li>Architect, design, and implement a plethora of features/products we have in the pipeline.</li>\n<li>Collaborate with product, design, marketing, and engineering team on building features and functionality.</li>\n<li>Perform code reviews to your teammates.</li>\n<li>Discuss, implement, and document subjects like Engineering processes, best practices, code quality, testing, continuous integration/deployment, and more.</li>\n</ul>\n",
        "how_to_apply": "<p>Please apply <a href=\"https://jobs.lever.co/lev/3452b758-2959-484d-b695-a905b2a9f3b5?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWFFIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8e72918f03a3dcf6257d7a4daed55b2a075399f8/dark-square-512.png"
      },
      {
        "id": "3f87be14-2b50-4873-9c7d-e4a722a614a1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3f87be14-2b50-4873-9c7d-e4a722a614a1",
        "created_at": "Mon Jun 01 21:10:22 UTC 2020",
        "company": "Bombas",
        "company_url": "https://bombas.com",
        "location": "New York",
        "title": "Software Engineer",
        "description": "<p><strong>Job Title:</strong> Software Engineer</p>\n<h2>About Bombas:</h2>\n<p>Bombas is a comfort focused apparel brand with a mission to help those in need. The company launched in 2013, after the founders learned that socks are the #1 most requested clothing item at homeless shelters. From there, they set out to solve that problem, donating a pair of socks for every pair they sell. How do you donate a lot of socks? You sell a lot. And how do you sell a lot? You make the most comfortable socks in the history of feet. Millions of pairs sold and donated later, Bombas is continuing to innovate with new socks and apparel while creating a positive impact on the community where we all work and live.</p>\n<p>At Bombas, comfort is heavily rooted in our DNA. While striving to provide comfort for all, we welcome and celebrate minds from all backgrounds regardless of age, color, ethnicity, gender or gender identity, genetics, physical or mental ability, protected veteran status, race, religion and sexual orientation. We highly encourage candidates of all backgrounds to apply. Come as you are and we’ll welcome you to the Hive.</p>\n<h2>About the Job:</h2>\n<p>We are looking for a product-minded and versatile team player to join our Engineering team as our Software Engineer. The ideal candidate has 3-5 years of experience in software engineering.</p>\n<p>This is an opportunity to have direct input into the creation of foundational processes and systems that shape the future of our business. You’ll have the opportunity to work with a wide variety of stakeholders across all departments, and will serve as a key partner to our Creative, Marketing, and Product teams to help launch new product initiatives.</p>\n<h2>What you’ll be responsible for:</h2>\n<ul>\n<li>Refine our stack as we move to an API-first architecture and React.</li>\n<li>Ship DRY and scalable code with a focus on performance optimization and backed by unit tests.</li>\n<li>Work with our Product team to translate business needs into efficient and practical solutions.</li>\n<li>Inform our enterprise architecture and help build, integrate, and maintain a growing array of internal and third-party applications and services.</li>\n</ul>\n<h2>What we’ll love about you:</h2>\n<ul>\n<li>Can balance quality with time to market to show value while building toward a longer term vision.</li>\n<li>You care about testing and automation, and know what it means to ship high quality code.</li>\n<li>Strong strategic problem solving - can clearly understand customer problems and business needs and translate them into innovative solutions.</li>\n<li>Track record of leading the implementation of foundational systems.</li>\n<li>A team player who is willing and happy to help.</li>\n<li>Strong written and verbal communication skills.</li>\n<li>Belief in our mission and understand the importance of giving-back.</li>\n<li>Inquisitive, love to learn, embrace failure, and never give up.</li>\n<li>Comfortable working in an open office environment while staying focused.</li>\n</ul>\n<h2>What you’ll love about us:</h2>\n<ul>\n<li>We are a team of smart, interesting, diverse, funny, and loving people.</li>\n<li>We offer competitive compensation, employer paid health, medical and dental benefits, 401k with match, paid parental leave, snacks, socks and a fun, relaxed office environment.</li>\n<li>We take the responsibility to make sure you are excited, happy, and find fulfillment in your work very seriously.</li>\n<li>We value fun. This is why we host office lunches, offsite team outings, and two annual company retreats.</li>\n<li>We believe in giving back to the community and helping those in need, which is why we volunteer as a team regularly.</li>\n<li>We believe success comes from the collective effort of all, which is why all full-time employees receive equity in the business.</li>\n<li>We offer flexible paid time off for all full-time employees. This includes unlimited vacation, sick days, and wellness days because we understand the value of health, relaxation, spending time with friends and family, and traveling the world.</li>\n<li>We believe a healthy body equals a healthy mind, so we offer a $100 monthly health and wellness reimbursement.</li>\n</ul>\n<h2>What you’ll bring:</h2>\n<ul>\n<li>3-5 years of experience in software engineering.</li>\n<li>Comfortable developing modern Ruby, Go, or JavaScript code.</li>\n<li>Experience architecting and using relational databases.</li>\n<li>Knowledge of both building internal and consuming third-party APIs and have a strong grasp of REST architecture (GraphQL a plus).</li>\n<li>Developed and operated production applications in a Linux environment (AWS a plus).</li>\n<li>Experience with e-commerce is a plus.</li>\n</ul>\n<p>If you require reasonable accommodation in completing this application, interviewing, completing any employment testing, or otherwise participating in this hiring process, please direct your inquiries to our Director of Talent Acquisition at <a href=\"mailto:nick.sottile@bombas.com\">nick.sottile@bombas.com</a>.</p>\n",
        "how_to_apply": "<p><a href=\"https://boards.greenhouse.io/bombas/jobs/2197242\">https://boards.greenhouse.io/bombas/jobs/2197242</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHVFIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--08a734b049e204ebb052329bcbb5e869563620f2/bombas-logo.png"
      },
      {
        "id": "45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
        "created_at": "Mon Nov 19 19:40:01 UTC 2018",
        "company": "Prosek Partners",
        "company_url": "https://www.prosek.com",
        "location": "Fairfield, CT",
        "title": "Front End Developer",
        "description": "<p>Background</p>\n<p>Prosek Partners, one of the top 25 marketing communications and public relations companies in the U.S., is seeking a talented, versatile and motivated full-time Front End Developer to join our growing creative services team in Fairfield, Connecticut.</p>\n<p>The Front End Developer will take on a key role as we begin building our internal development team. The position will be responsible for developing and executing high-quality web productions for client related projects and occasional in-house programs. The ideal candidate would be at the center of the Prosek development team. They key area of focus will be building a best-in-class web-based UI/UX and requires extensive knowledge of web applications ecosystems. The Front End Developer will be part of a dynamic, evolving environment providing rapid delivery across multiple sectors for our varied clients, with a strong desire to lead change as we continue to build our agile transformational workflow. Along with these tasks, the professional we seek will also be a key participant in the creation of strategies and marketing campaigns for both our clients and internal stakeholders, and work on a variety of other projects collaborating with team members throughout our five offices in New York, Boston, Fairfield, Los Angeles and London.</p>\n<p>Technical skills:</p>\n<ul>\n<li>Design overall architecture of web applications, while maintaining quality, code integrity and organization to ensure responsiveness of applications</li>\n<li>Understanding of fundamental design principles behind scalable applications and participate in collaborative team efforts with responsive, user experience and user interface design</li>\n<li>Understanding differences between multiple delivery platforms (such as mobile vs, desktop), and optimizing output to function on specific platforms</li>\n<li>Delivering reusable components, code and front-end libraries for future use</li>\n<li>Translating designs and wireframes into high quality, tested code</li>\n<li>Experience with interactive web elements and motion</li>\n<li>Able to identify opportunities for process and tool improvements</li>\n<li>Proficient knowledge of front/back-end programming languages: HTML5, CSS3 and JavaScript are necessary, with in-depth understanding of DOM</li>\n<li>Understanding of CSS pre- and post-processors</li>\n<li>Experience working with third party services, APIs, and content management systems.</li>\n<li>Proficient in Adobe Creative Cloud including, but not limited to, Photoshop, Illustrator and InDesign</li>\n<li>Comprehensive awareness and interest in new technologies</li>\n<li>Understanding of full-stack requirements and deployments</li>\n<li>Enforce front-end code compliance with web for cross-browser and platform compatibility</li>\n</ul>\n<p>As a Front End Developer, you will be expected to:</p>\n<ul>\n<li>Be self-motivated, detail-oriented and confident</li>\n<li>Capable of analyzing challenges and create on-brand design solutions that meet measurable business goals and requirements</li>\n<li>Translate ideas, end-user needs, design criteria, and technical features into quality web productions</li>\n<li>Present and defend technical recommendations to the team</li>\n<li>Able to speak not just passionately about your work but also plainly to those who are inexperienced</li>\n<li>Have a strong grasp of storytelling through layout and information design</li>\n<li>Possess excellent written and verbal communication skills</li>\n<li>Be comfortable with getting and giving feedback; be flexible and willing to learn and passionate about mentoring and collaborating with other designers</li>\n<li>Able to work under tight deadlines, with little supervision</li>\n<li>Rise above the competition: tell us about your experience with mobile app development</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Bachelor's degree in computer science or related field</li>\n<li>3-5 years of professional IT-related experience</li>\n<li>Demonstrate a strong set of visual, written and oral communication skills, a meticulous eye for detail, and the ability to create work inspired by ideas and not trends</li>\n<li>Fluency in Adobe Creative Cloud is a must, with bonus points going to those who can function across Windows and OS X.</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:developerjobs@prosek.com\">developerjobs@prosek.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d1fc63cd3c42af58e8eb57769e49386c3a54c6/56db6e1a-a723-4256-b184-6fc3e13db90a"
      },
      {
        "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
        "created_at": "Mon Nov 19 15:44:44 UTC 2018",
        "company": "Aon Cyber Solutions",
        "company_url": "http://www.strozfriedberg.com/careers",
        "location": "NY or LA",
        "title": "Cybersecurity Firm Seeks Senior Developer",
        "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
        "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
        "company_logo": null
      },
      {
        "id": "fda26124-e9e7-11e8-9f44-4d0452dab2f9",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fda26124-e9e7-11e8-9f44-4d0452dab2f9",
        "created_at": "Fri Nov 16 21:43:59 UTC 2018",
        "company": "The Franklin Report",
        "company_url": "http://www.franklinreport.com",
        "location": "New York, NY",
        "title": "Software Developer",
        "description": "<p>We’re a hybrid company: a legacy media property with deep authority in our market, looking to create a disruptive piece of software in the job search space. We’re looking for hungry, smart developer to help us build it. You’d be collaborating with an existing team (one US based project lead, a small crew in India) to create the underlying database structure and business logic, and help polish the user interface.</p>\n<p>Extensive work experience is not required. However, proficiency in the .NET platform is a must. Expertise in some but not all of the following languages is crucial:\nMVC.Net\nSQL Server\nC#\nJavascript</p>\n<p>Preference will be given to candidates who can do at least some time in our Manhattan office. However, we are open to remote arrangements for the right fit (US only). The position will start as a part time arrangement, with room to grow into full-time.</p>\n",
        "how_to_apply": "<p>email your resume to <a href=\"mailto:fred@franklinerport.com\">fred@franklinerport.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--56f0ca505d4d7e7584c9c058903dd52c3275e3a0/e4139e25-14a3-48b4-9ab2-caa5f0a61165"
      },
      {
        "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d28b2d1a-e85a-11e8-9b78-62dc829f5516",
        "created_at": "Wed Nov 14 22:16:02 UTC 2018",
        "company": "The Atlantic",
        "company_url": "http://theatlantic.com",
        "location": "Washington, DC & New York, NY",
        "title": "Lead Front End Developer",
        "description": "<p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. This role can be based in either Washington, DC or New York, NY.</p>\n<p><strong>Who You Are</strong></p>\n<p>You are an experienced developer with proven leadership and management experience.</p>\n<p>You are well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits.</p>\n<p>Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow. You know how to evaluate new technology and determine which path will best fit our business needs.</p>\n<p>Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.</p>\n<p><strong>Primary Responsibilities</strong>:</p>\n<ul>\n<li>Provide feedback and mentorship to the front end team through weekly one-on-one check as well as mid and end of the year reviews</li>\n<li>Help plan and execute team and individual goals, with an eye on team growth and development</li>\n<li>Champion ways to improve our front end tech stack, including tooling, unit testing, and architecture</li>\n<li>Collaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary while always keeping in mind long term maintainability</li>\n<li>Act as a role model to others on the team by exhibiting strong work ethic and technical expertise when writing code or building new website features</li>\n<li>Act as a expert who can provide technical help and guidance to the other front end developers</li>\n</ul>\n<p><strong>Requirements</strong>:</p>\n<ul>\n<li>Proven experience with technical leadership and management</li>\n<li>Experience architecting a front end codebase at scale</li>\n<li>Strong technical and non-technical communication skills</li>\n<li>Able to look at a design and break it into well organized reusable components</li>\n<li>Experience planning, ticketing, and executing team projects</li>\n<li>Comfortable with Git for version control</li>\n<li>Effective time management when working on multiple projects</li>\n<li>Passionate about front end performance with up-to-date knowledge of current techniques</li>\n<li>Familiar with Node.js and modern frontend build tooling</li>\n<li>Knowledgeable about modern JavaScript frameworks but comfortable working in Vanilla JS</li>\n<li>Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and - JavaScript suitable for a complex, fast-changing website</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n<p><strong>Atlantic Media Values</strong>:</p>\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –</p>\n<ul>\n<li>\n<strong>Force of Ideas</strong>: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.</li>\n<li>\n<strong>Spirit of Generosity</strong>: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.</li>\n</ul>\n<p><em>Atlantic Media is an EOE of Minorities/Women/Vets/Disability</em>.</p>\n<p><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>\n",
        "how_to_apply": "<p>Apply online: <a href=\"https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\">https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5696c45ec9ba49ead9190535e55a9e2ca213021/dda99823-bc1b-4669-800b-48e3971f2d37"
      },
      {
        "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e9e93a6-e85a-11e8-8963-f68a643e24dd",
        "created_at": "Wed Nov 14 22:11:05 UTC 2018",
        "company": "The Atlantic",
        "company_url": "http://theatlantic.com",
        "location": "Washington, DC & New York, NY",
        "title": "Senior Front End Developer",
        "description": "<p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. The role can be based in either Washington, DC or New York, NY.</p>\n<p><strong>Who You Are</strong></p>\n<p>You are an experienced developer and solid communicator with an interest in journalism and the media business.</p>\n<p>You’re well versed in the modern front-end: ES6, SCSS, understand what makes good markup, and how to best use the capabilities of the browser. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits. Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow.</p>\n<p>Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.</p>\n<p><strong>Primary Responsibilities:</strong></p>\n<ul>\n<li>Implement new features for TheAtlantic.com and CityLab.com where they will be viewed by millions of people</li>\n<li>Champion ways to improve our front end tech stack, including tooling, unit testing, and architecture</li>\n<li>Collaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary</li>\n<li>Mentor junior developers and act as a subject expert</li>\n<li>Thinks strategically and systematically when planning or coding a project, always keeping in mind long term maintainability</li>\n<li>Work to continually reduce our front end website load time</li>\n<li>Communicate and collaborate with both technical and non-technical members of the team</li>\n</ul>\n<p><strong>Requirements:</strong>\n-Experience architecting a front end codebase at scale\n-Strong technical and non-technical communication skills\n-Able to write semantic and accessible markup that our growing team can easily maintain and iterate with\n-Able to look at a design and break it into well organized reusable components\n-Comfortable with Git for version control\n-Effective time management when working on multiple projects\n-Passionate about front end performance with up-to-date knowledge of current techniques\n-Familiar with Node.js\n-Knowledgeable about modern JavaScript frameworks but comfortable working in vanilla JS as appropriate\n-Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and JavaScript suitable for a complex, fast-changing website</p>\n<p><strong>Benefits</strong></p>\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n<p><strong>Atlantic Media Values:</strong></p>\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –</p>\n<ul>\n<li>\n<strong>Force of Ideas</strong>: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.</li>\n<li>\n<strong>Spirit of Generosity</strong>: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.</li>\n</ul>\n<p><em>Atlantic Media is an EOE of Minorities/Women/Vets/Disability.</em></p>\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n",
        "how_to_apply": "<p>Apply online: <a href=\"https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\">https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d395d665d7dd3f82d64d22e06b39f41ba13e36c9/f749e401-94c5-477e-8c8b-fb68335e240b"
      },
      {
        "id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
        "created_at": "Sat Nov 10 02:02:55 UTC 2018",
        "company": "Sesame",
        "company_url": "http://sesamecare.com",
        "location": "New York; Berlin",
        "title": "Software engineer (back end)",
        "description": "<p>We’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.</p>\n<p>Our all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.</p>\n<p>We believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.</p>\n<p>We’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.</p>\n<p>We must be on to something, since we’re proud to say:</p>\n<ul>\n<li>We have engineering teams in New York and Berlin</li>\n<li>We've raised millions in funding to grow U.S. operations.</li>\n</ul>\n<p>Want to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.</p>\n<p><strong>About you:</strong></p>\n<ul>\n<li>Comfortable with Java and microservices.</li>\n<li>You seek and prefer simple solutions to complex problems.</li>\n<li>You strive to write clean, quality code and enjoy doing it.</li>\n<li>You maintain a healthy balance between perfectionism and actually getting stuff done.</li>\n<li>You either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.</li>\n<li>You love developing software. You have 2+ years of industry experience.</li>\n<li>You are a strong team player, have strong writing skills, and enjoy collaborating with others.</li>\n<li>You are attuned to the fundamentals of user design and user experience.</li>\n</ul>\n<p><strong>Our technology stack includes:</strong></p>\n<ul>\n<li>Java 10</li>\n<li>Spring Boot</li>\n<li>Kubernetes</li>\n<li>Docker</li>\n<li>GraphQL</li>\n<li>Pub/Sub</li>\n<li>Postgres</li>\n<li>Python</li>\n<li>NodeJs</li>\n</ul>\n<p><strong>Our Offer:</strong>\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.</p>\n<p><strong>Perks:</strong>\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.</p>\n<p>Sesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
      },
      {
        "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "created_at": "Fri Nov 09 14:51:11 UTC 2018",
        "company": "New York University",
        "company_url": null,
        "location": "New York, New York 10001",
        "title": "Technology Solutions Developer",
        "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n",
        "how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n",
        "company_logo": null
      },
      {
        "id": "fa15462c-e201-11e8-9ee9-cfbf28397977",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fa15462c-e201-11e8-9ee9-cfbf28397977",
        "created_at": "Tue Nov 06 20:25:06 UTC 2018",
        "company": "Constructive",
        "company_url": "http://constructive.co",
        "location": "New York, New York",
        "title": "Sr. Web Developer (Full-Stack/WP), Social Change Design Agency",
        "description": "<p><strong>Sr. Web Developer (Full-Stack/WP), Digital Agency for Social Change</strong></p>\n<p>Constructive, a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to join our team as a Sr. Web Developer.</p>\n<p>If you’re an experienced technologist who has demonstrated expertise building Wordpress websites that demand a high degree of creative and technical complexity, thrive on being a collaborative problem solver, and believe that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. And if you care deeply about issues like climate change, social justice, and economic equality—and want to work on interesting projects that make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p><strong>A bit about the role</strong></p>\n<p>Sr. Web Developers at Constructive need great expertise both in creating powerful back-end publishing systems and in elegant front-end digital experiences. They need to write code that’s semantically sound and adheres to current best practices. They must be proactive thinkers who are always looking to bring new ideas to the table and improve how we work. And they must thrive on working collaboratively in multi-disciplinary teams.</p>\n<p><strong>A bit about us</strong></p>\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We have high expectations and the work ethic to match them. And we’re all together in the same open office, so there’s music and a lot of joking mixed-in with being heads-down on work.</p>\n<p><strong>A bit about diversity</strong></p>\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant.</p>\n<p><strong>What we need you to do extremely well</strong></p>\n<p>We’re looking for a developer who’s eager to play a leading role in Constructive’s digital practice. We’ll need you to have strong demonstrated success having done all or most of the following things for at least 3-5 years—and a passion for doing them extremely well.</p>\n<ul>\n<li>Understand the web development landscape, contributing significantly to creating internal technology strategies that align with broader brand strategy.</li>\n<li>Collaborate across teams to plan and execute ambitious digital projects.</li>\n<li>Develop backend and frontend, taking ownership of your projects from start to finish.</li>\n<li>Participate in QA/UAT testing to ensure that what we deliver is what we promised—and that it lives up to our standards.</li>\n<li>Document your work to make it easier for other developers, both now and in the future, to work with what you’ve built.</li>\n<li>Improve best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of-field.</li>\n<li>Contribute to ongoing development and support for existing websites.</li>\n<li>Contribute to developing proposals and estimates for projects you will be a lead developer.</li>\n<li>Be a team player who has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li>Have a sense of humor. Seriously, life can be stressful enough these days.</li>\n</ul>\n<p><strong>Expertise that’s important in our work</strong></p>\n<p>Right now, these are the specific technologies and tasks that are essential to our work (which we always remain open to evaluating and evolving). We’ll need you to have about 5 years of professional experience in most of these things.</p>\n<ul>\n<li>Expert-level Wordpress Development (Min 3 years experience)</li>\n<li>Expert CSS chops (and SCSS!)</li>\n<li>Strong front-end development experience (experience with at least 1 Javascript framework: React, Angular, Vue)</li>\n<li>Strong preprocessor experience (Webpack / Gulp)</li>\n<li>Strong Git experience</li>\n<li>Experience with MySQL</li>\n<li>Experience executing third-party integrations (Salesforce, Mailchimp, Blackbaud, Fluxx, Google Maps API, etc.)</li>\n<li>Comfortable with D3</li>\n<li>Comfortable with AWS</li>\n<li>Comfortable with Server Administration &amp; DevOps</li>\n</ul>\n<p><strong>What’s in it for you?</strong></p>\n<p>We do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Along with your base salary, here are the benefits and perks we have on tap at Constructive for 2018-2019 to add to this:</p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<ul>\n<li>Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus+performance bonuses (no less than 10% of company profit split equally by all employees as profit sharing)</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year's</li>\n<li>1/2-day Summer Fridays (Approx 16 days)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly employee-voted gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place.</li>\n</ul>\n<p><strong>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>A resume</li>\n<li>A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>Links to your own website, websites you’ve worked on, github, whatever\nDesired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "how_to_apply": "<p>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</p>\n",
        "company_logo": null
      },
      {
        "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e",
        "created_at": "Tue Nov 06 20:19:44 UTC 2018",
        "company": "Cortex Building Intelligence",
        "company_url": "https://cortexintel.com/",
        "location": "New York, NY",
        "title": "Software Engineer, Full Stack (Rails, React)",
        "description": "<p><strong>Company Description</strong></p>\n<p>Cortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).</p>\n<p><strong>Job Description</strong></p>\n<p>At Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Creating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.</li>\n<li>Integrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.</li>\n<li>Working closely with our Customer Success team to support client onboarding and operations.</li>\n<li>Taking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.</li>\n<li>Strong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.</li>\n<li>Experience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.</li>\n<li>Product-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.</li>\n<li>Excellent verbal and written communication skills.  Committed, hard-working, and thoughtful.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.</li>\n<li>Unlimited paid time off.</li>\n<li>Your choice of 13” or 15” Macbook Pro.</li>\n<li>Work in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.</li>\n</ul>\n",
        "how_to_apply": "<p>Schedule a time to chat with our CTO, Justin Spradlin: <a href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\">https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"
      },
      {
        "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
        "created_at": "Fri Nov 02 19:02:51 UTC 2018",
        "company": "Jun Group",
        "company_url": "https://www.jungroup.com/",
        "location": "New York, NY",
        "title": "Senior Software Developer, Server-Side Technologies",
        "description": "<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events</li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/06736d9f2\">https://grnh.se/06736d9f2</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--726761e0459b97d7da1749cd58bef48691f6529f/f1729282-ab89-4940-8f76-77e7ad8e1cae"
      },
      {
        "id": "0a9333c4-71da-11e0-9ac7-692793c00b45",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45",
        "created_at": "Thu Nov 01 13:09:37 UTC 2018",
        "company": "Jane Street",
        "company_url": "http://janestreet.com",
        "location": "New York, NY; London, UK; Hong Kong",
        "title": "Software Developer (Functional Programming)",
        "description": "<p>Software Developer</p>\n<p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p>\n<p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p>\n<p>We are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.</p>\n<p>The atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.</p>\n<p>You can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (<a href=\"http://ocaml.janestreet.com/?q=node/61\">http://ocaml.janestreet.com/?q=node/61</a>), and our programming blog (<a href=\"http://ocaml.janestreet.com\">http://ocaml.janestreet.com</a>).</p>\n<p>We also have extensive benefits, including:</p>\n<ul>\n<li>90% book reimbursement for work-related books</li>\n<li>90% tuition reimbursement for continuing education</li>\n<li>Excellent, zero-premium medical and dental insurance</li>\n<li>Free lunch delivered daily from a selection of restaurants</li>\n<li>Catered breakfasts and fresh brewed Peet's coffee</li>\n<li>An on-site, private gym in New York with towel service</li>\n<li>Kitchens fully stocked with a variety of snack choices</li>\n<li>Full company 401(k) match up to 6% of salary, vests immediately</li>\n</ul>\n<p>More information at <a href=\"http://janestreet.com/culture/benefits/\">http://janestreet.com/culture/benefits/</a></p>\n",
        "how_to_apply": "<p>Please apply through our web app form at  <a href=\"https://www.janestreet.com/join-jane-street/apply/\">https://www.janestreet.com/join-jane-street/apply/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f6dec9502d27094bbc9c7ff6c33806d0cdbb6faf/ac79023f-6a10-488b-be9f-751264dd8d06"
      },
      {
        "id": "1ee011f0-dcbf-11e8-8f6b-cc4dc5b4578d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1ee011f0-dcbf-11e8-8f6b-cc4dc5b4578d",
        "created_at": "Wed Oct 31 03:43:54 UTC 2018",
        "company": "Petal",
        "company_url": "https://www.petalcard.com/",
        "location": "New York City or Remote (US)",
        "title": "Senior Software Engineer",
        "description": "<p>Petal is the first credit card for people without a credit history. We analyze cashflow from applicants' bank accounts to evaluate credit quality, which enables us to provide credit to populations traditionally excluded from financial services.</p>\n<p>As a Senior Software Engineer, you'll architect, design, and implement major sub-systems across our platform.</p>\n<p>What you'll do</p>\n<p>Lead projects and provide technical leadership in subject matter expertise.\nOwn large portions of the code base.\nDesign secure and highly reliable services to integrate with our data and credit card processing partners.\nBuild frameworks and products which will be used by other engineering teams at Petal.\nWrite tests and constantly seek to improve code quality and reliability.\nBring positive energy to every meeting and make your colleagues feel included and heard.</p>\n<p>Experience</p>\n<p>You've demonstrated your ability to build, test, release, and maintain complex products.\nYou demand high-quality code of yourself and others.\nYou love trying new tools, technologies, and frameworks, but are pragmatic—you get stuff done with what solves the problem you’re facing.\nYou love shipping new things rapidly and iterating based on real user behaviour. You have a knack for finding and eliminating inefficiency in your users’ workflows.\nYou’re enthusiastic about unit testing and performance, and knowing how to communicate the value of technical excellence to non-technical teammates.\nYou’re a great listener, but are willing to speak up when you see something that needs to be fixed. You ask questions when something isn’t clear.</p>\n<p>Understanding that smart, hungry people can rapidly learn new technologies, here is our tech stack: <a href=\"https://stackshare.io/petal\">https://stackshare.io/petal</a></p>\n",
        "how_to_apply": "<p>Email your LinkedIn profile to <a href=\"mailto:nathan@petalcard.com\">nathan@petalcard.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--141ec03885a07949373c47fc21d75fe420c3ab16/54a97145-8c66-4c73-aeb7-1f261a002122"
      },
      {
        "id": "40ca8a98-a4bb-11e8-9a40-f75b414612e1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/40ca8a98-a4bb-11e8-9a40-f75b414612e1",
        "created_at": "Mon Oct 22 16:33:37 UTC 2018",
        "company": "Reaktor",
        "company_url": "http://reaktor.com",
        "location": "New York",
        "title": "A Challenge for Developers: Solve the Tracking Game ",
        "description": "<p><strong>Reaktor is looking for developers who solve puzzles other deem\nimpossible. Are you one? Play the Tracking Game.</strong></p>\n<p>“A diamond-mining vessel has gone missing. Three days ago, the ship sent out a distress signal, and then dropped off of the face of the Earth.</p>\n<p>If you and the satellite can’t find the ship…well, let’s just that we’re likely to lose more than precious cargo.”</p>\n<p>The Tracking Game is a puzzle and a mystery to be solved, with the help of coding skill and satellite data. Your job is to embark on a journey around the world, uncover the secrets of the sisterhood, and come out on top.</p>\n<p>What’s in it for the world: For every 100th solver, we’re donating 1000 dollars to The Rainforest Alliance. What’s in it for you: solvers looking for a job with us get on our fast track.</p>\n<p><strong>Good luck.</strong></p>\n",
        "how_to_apply": "<p>Play the <a href=\"https://tracking-game.reaktor.com/\">Tracking Game</a>.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnRWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4fcf11b6ee4b89d7de50bd7838a49502f08ac0c1/49217dad-be27-491e-b0f9-dbede0efed18"
      },
      {
        "id": "df5b47be-d612-11e8-88f4-50633736745c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/df5b47be-d612-11e8-88f4-50633736745c",
        "created_at": "Mon Oct 22 15:56:13 UTC 2018",
        "company": "Constructive",
        "company_url": "http://www.constructive.co",
        "location": "New York City",
        "title": "Technology Team Lead, Design Agency for Social Impact",
        "description": "<p>Constructive (<a href=\"https://constructive.co\">https://constructive.co</a>), a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to take over for our current Technology Team Lead, who will sadly be transitioning out of the role at the end of 2018 to live abroad.</p>\n<p>If you’re an experienced technologist who wants to work on websites and products that are at the front of the field, knows how to architect and build complex websites, thrives on being a consultative, collaborative problem solver, and believes that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. If you care deeply about issues like climate change, social justice, and economic equality—and want the work you do to make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p>##A bit about the role\nOur Technology Team Lead needs a holistic understanding of modern web development techniques and infrastructure. They need experience building strong and scalable websites. They must thrive on being hands-on with development projects. They’ll need a leadership mindset, and must be capable of working on multi-disciplinary teams to communicate complex technological choices to non-developers.</p>\n<p>That’s all fancy job-posting language for: you really know your stuff and don’t have a big ego, you take responsibility for the quality of our work and the growth of your team, you still like to get your hands dirty with code, and you’re an effective collaborator—especially with people who don’t understand technology as well as you do.</p>\n<p>##A bit about us\nWe’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We’ve got high expectations and we’ve got the work ethic to match them. We’re all together in the same open office, so there’s music and joking mixed-in with being heads-down on work.</p>\n<p>##A bit about diversity\nWe believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant—and if you meet those and add to our diversity, all the better.</p>\n<p>##What we need you to do extremely well\nThis role combines technology team leadership and hands-on development, emphasizing one or the other at any given time. We’ll need you to have strong demonstrated success having done all or most of these things for at least 3-5 years—and a passion for doing them well.</p>\n<ul>\n<li>\n<strong>Provide strong technical leadership</strong>—both for our internal team of developers, strategists, and designers; and for our clients and occasional external dev partners.\nManage and mentor junior developers—two in-house developers, one ongoing external partner, and any additional developers when project load requires it.</li>\n<li>\n<strong>Guide development team</strong> and our company on planning, prioritizing, mitigating risks, and balancing technical debt to meet project milestones so that we deliver exceptional work that meets expectations.</li>\n<li>\n<strong>Work with stakeholders to define strategic goals</strong> and the context in which they need to be met, gather requirements, and produce technical documentation that makes it very clear how technology will help achieve them.</li>\n<li>\n<strong>Develop requirements, specifications, and architecture</strong> to document what we’re building and what’s been built.</li>\n<li>\n<strong>Lead development of ambitious digital products,</strong> serving as the point person for both the end-to-end process and the outcomes we deliver, aligning our work with Constructive’s broader strategic position as a leading brand experience design firm.</li>\n<li>\n<strong>Be a hands-on developer</strong> who takes on specific aspects of complex jobs or plays a lead developer role on a project when needed.</li>\n<li>\n<strong>Review code and provide feedback</strong> on work done by other developers; oversee the UAT and QA processes in coordination with project managers.</li>\n<li>\n<strong>Improve best practices, recommend tools, and build frameworks</strong> that make our work more efficient, effective, and technically front-of field.</li>\n<li>\n<strong>Be the face of Constructive’s technical expertise</strong> throughout client engagements, in the development community, and when needed in our sales cycle.</li>\n<li>\n<strong>Contribute to developing proposals and estimates</strong> for technical projects, particularly those with complex requirements.</li>\n<li>\n<strong>Lead vetting and hiring of web developers</strong> and external development partners.</li>\n<li>\n<strong>Be a team player</strong> who knows how to lead, has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li><strong>It definitely helps if you also have a good sense of humor</strong></li>\n</ul>\n<p>##Expertise that’s important in our work\nRight now, these are the specific technologies and tasks that are essential to our work. We’ll need you to have about 5 years of experience in most of these things, and we’re very open to new ideas on which specific technologies and tools can improve on what we have.</p>\n<ul>\n<li>Expert Wordpress &amp; Drupal development (Minimum 5 years of experience)</li>\n<li>Expert front-end development experience</li>\n<li>Strong experience with Webpack / Gulp / SCSS</li>\n<li>Strong experience doing large-scale content migrations</li>\n<li>Strong experience doing third-party integrations (Solr, Salesforce, Mailchimp, Fluxx)</li>\n<li>Experience with Data Visualization (D3, Highcharts)</li>\n<li>Experience with Infrastructure, System Administration &amp; DevOps</li>\n<li>Experience with ES6, Node, React</li>\n</ul>\n<p>##What’s in it for you?\nWork/Life balance matters at Constructive, and we do our best to make sure everyone is well-taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Added to your base salary, here’s what we have on tap for 2018-2019 to add:</p>\n<p>##Benefits &amp; Perks</p>\n<ul>\n<li>Company-Sponsored Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus (Approx 10% of company profit distributed equally)</li>\n<li>Discretionary performance-based bonuses</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year’s</li>\n<li>1/2-day Summer Fridays (Approx 16)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly &amp; Annual employee-voted \"shout-out\" gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place</li>\n</ul>\n",
        "how_to_apply": "<p><strong>Interested? Great! Then please send an email to titled “Technology Team Lead” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>• A resume</li>\n<li>• A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>• Links to your own website, websites you’ve worked on, github, whatever</li>\n<li>• Desired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3235bba838d5ca1495e8b2f6b73a0e54ee613498/caadf965-8957-438b-b2f8-12af175c8721"
      },
      {
        "value": "m",
        "isCompleted": false,
        "id": "_ER2Koa"
      },
      {
        "value": "fb",
        "isCompleted": false,
        "id": "gQy6uHI"
      }
    ]
  }